emacs-linguist.org
:PROPERTIES:
:ID:       34BF0D46-C8B8-4B05-8381-3E59693E6143
:ROAM_ALIASES: emacs-linguist
:END:
#+title: linguist.el: A language modes pack for Emacs
#+author: Jeff Kreeftmeijer
#+date: 2023-03-05
#+options: toc:nil

Linguist is a language modes pack for Emacs, inspired by [[https://github.com/sheerun/vim-polyglot][vim-polyglot]].

#+begin_src emacs-lisp :tangle linguist.el :exports none
  (defun linguist--loaded-message (mode)
    (message (concat "Linguist: Loaded " mode ".")))
#+end_src

* Language packs

** [[https://github.com/elixir-editors/emacs-elixir][elixir-mode]]

#+begin_src emacs-lisp :tangle linguist.el
  (use-package elixir-mode
    :config (linguist--loaded-message "elixir-mode")
    :mode ("mix\\.lock" . elixir-mode)
    :mode ("\\.exs\\'" . elixir-mode)
    :mode ("\\.ex\\'" . elixir-mode)
    :mode ("\\.elixir\\'" . elixir-mode))
#+end_src

** [[https://github.com/magit/git-modes/blob/main/gitignore-mode.el][gitignore-mode]]

#+begin_src emacs-lisp :tangle linguist.el
  (use-package git-modes
    :config (linguist--loaded-message "gitignore-mode")
    :mode ("/git/ignore\\'" . gitignore-mode)
    :mode ("/info/exclude\\'" . gitignore-mode)
    :mode ("/\\.gitignore\\'" . gitignore-mode))
#+end_src

** [[https://github.com/ledger/ledger-mode][ledger-mode]]

#+begin_src emacs-lisp :tangle linguist.el
  (use-package ledger-mode
    :config (linguist--loaded-message "ledger-mode")
    :mode ("\\.ledger\\'" . ledger-mode))
#+end_src

** [[https://github.com/jrblevin/markdown-mode][markdown-mode]]

#+begin_src emacs-lisp :tangle linguist.el
  (use-package markdown-mode
    :config (linguist--loaded-message "markdown-mode")
    :mode ("\\.\\(?:md\\|markdown\\|mkd\\|mdown\\|mkdn\\|mdwn\\)\\'" . markdown-mode))
#+end_src

** [[https://github.com/yoshiki/yaml-mode][yaml-mode]]

#+begin_src emacs-lisp :tangle linguist.el
  (use-package yaml-mode
    :config (linguist--loaded-message "yaml-mode")
    :mode ("\\.\\(e?ya?\\|ra\\)ml\\'" . yaml-mode))
#+end_src

* Adding language packs

Each language pack requires one or multiple =:mode= keys with patterns to automatically load the mode when a file that matches it is opened.

The easiest way to determine patterns for new language packs is to extract them from =auto-mode-alist=.
To do this, first install the package by installing it for the current session:

#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

Then, open the help page for =auto-mode-alist= (=C-h= =v= auto-mode-alist =<RET>=) and find the patterns for the package being added:

#+begin_src emacs-lisp
  ("\\.\\(e?ya?\\|ra\\)ml\\'" . yaml-mode)
#+end_src

Take all pattern lines corresponding to the new package and add them as =:mode=​s in a call to =use-package=:

#+begin_src emacs-lisp
(use-package yaml-mode
  :config (linguist--loaded-message "yaml-mode")
  :mode ("\\.\\(e?ya?\\|ra\\)ml\\'" . yaml-mode))
#+end_src

If the package has multiple pattern lines, add a =:mode= for each:

#+begin_src emacs-lisp
(use-package elixir-mode
  :config (linguist--loaded-message "elixir-mode")
  :mode ("mix\\.lock" . elixir-mode)
  :mode ("\\.exs\\'" . elixir-mode)
  :mode ("\\.ex\\'" . elixir-mode)
  :mode ("\\.elixir\\'" . elixir-mode))
#+end_src
